lisp-range.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-29 Mon 15:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python range operator in lisp.</title>
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes">
<link rel="stylesheet" href="index.css">
<meta name="author" content="Wade Mealing" />
<meta http-equiv="Content-Security-Policy" content="style-src-elem 'self' https://wmealing.github.io;">
<meta name="description" content="Python range like operator in lisp" />
<meta http-equiv="Content-Security-Policy"  content="script-src 'self' ajax.googleapis.com;"" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Python range operator in lisp.</h1>
<p>
I've sometimes wanted a quick 'range' equivalent in common lisp.  There are likely other or easier ways to do it
but this way is mine.
</p>

<p>
Simple example to make a list for use:
</p>

<pre class="example" id="org54e89be">
(loop for i from 1 to 5 collect i)
</pre>

<p>
Easy, runs from 1 to 5, makes a list, its not lazy.. I don't think, but maybe there is a better generator.
</p>

<p>
Say if only evens were desired:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(loop for i from 1 to 10 do (when (evenp i)) collect i)
</pre>
</div>

<p>
note: that none of this is lazy, its not ideal.
</p>

<p>
There used to be another github library titled "Generators The Way I Want Them Generated" which looks really cool
but the account ahs been deleted.  I have a clone of a the source on quicklisp/ultralisp
<a href="https://github.com/wmealing/gtwiwtg">https://github.com/wmealing/gtwiwtg</a> although it seems that mr cbeo (the original owner) account has
terminated.  
</p>

<p>
The other alternative is 'snakes' which is available from <a href="https://github.com/BnMcGn/snakes">https://github.com/BnMcGn/snakes</a>.
</p>

<p>
When I get around to needing the lazyness of them, i'll put some demos here.
</p>
<div id="outline-container-org5b189a1" class="outline-2">
<h2 id="org5b189a1">Resources:</h2>
<div class="outline-text-2" id="text-org5b189a1">
<p>
<a href="https://github.com/BnMcGn/snakes">https://github.com/BnMcGn/snakes</a>
</p>

<p>
<a href="https://github.com/wmealing/gtwiwtg">https://github.com/wmealing/gtwiwtg</a> (not original)
</p>
</div>
</div>
</div>
</body>
</html>
